:PROPERTIES:
:ID:       d0bf116b-bff9-48bb-938d-7fa8766d1088
:END:
#+title: ENG231 - Electrical Machines And Transformers - Assignment 1
#+date: [2024-09-04 Wed 12:39]
#+AUTHOR: Baley Eccles - 652137
#+FILETAGS: :Assignment:UTAS:2024:
#+STARTUP: latexpreview

*** c
#+BEGIN_SRC octave :exports code :results output :session Q4
M_sat=1.4*10^6;
h_0=2230;
M=M_sat*(2/pi)*atan(6*i/5);
H=h_0*i;
x=M/H;
fprintf('The maximum value of the magnetic susceptibility of the core of the transformer is %f\n',max(x));
#+END_SRC

#+RESULTS:
: The maximum value of the magnetic susceptibility of the core of the transformer is 301.847007



*** b
#+BEGIN_SRC octave :exports code :results output :session Q5
% From Q4 Part a and b:
t=0:0.0001:0.1;
I_rms=1.14;
I_peak=I_rms*sqrt(2);
f=50;
w=2*pi*f;
i=I_peak*sin(w*t);
M_sat=1.4*10^6;
h_0=2230;

% Old code
M=M_sat*(2/pi)*atan(6*i/5);
H=h_0*i;
u_0=4*pi*10^(-7);
x_m=301.847007-1;
H=x_m*H + H;
B=u_0*H;

A=3*10^(-2)*3*10^(-2);
Phi=B*A;
EMF=-N* gradient(Phi)./gradient(t);

V_rms=240;
V_peak=V_rms*sqrt(2);
f=50;
w=2*pi*f;
t=0:0.0001:0.1;
V=V_peak*sin(w*t);

figure;
hold on;
plot(t(1:end), EMF, 'b', 'DisplayName', 'Induced EMF');
plot(t(1:end), V, 'r', 'DisplayName', 'Induced EMF');
xlabel('Time (s)');
ylabel('Voltage (V)');
title('Induced EMF vs Supply Voltage');

E_max=max(EMF);
fprintf('The max EMF induced is %f\n', E_max);
#+END_SRC

#+RESULTS:
: The max EMF induced is 339.254068


*** d
#+BEGIN_SRC octave :exports code :results output :session Q5d
clc
clear
A=3*10^(-2)*3*10^(-2);
t=0:0.0001:0.1;
I_peak=1.6;
f=50;
w=2*pi*f;
N=550;
M_sat=1.4*10^6;
h_0=2230;
u_0=4*pi*10^(-7);

i1=I_peak*sin(w*t);
H=h_0*i1;
u_0=4*pi*10^(-7);
x_m=301.847007-1;
H=x_m*H + H;
B=u_0*H;
A=3*10^(-2)*3*10^(-2);
Phi=B*A;
N=550;
E1=-N* gradient(Phi)./gradient(t);

I_peak2=3
i3=10^(-1)*I_peak2*sin(3*w*t);
H=h_0*i3;
u_0=4*pi*10^(-7);
x_m=301.847007-1;
H=x_m*H + H;
B=u_0*H;
A=3*10^(-2)*3*10^(-2);
Phi=B*A;
N=550;
E3=-N* gradient(Phi)./gradient(t);


i5=10^(-2)*I_peak*sin(5*w*t);
H=h_0*i5;
u_0=4*pi*10^(-7);
x_m=301.847007-1;
H=x_m*H + H;
B=u_0*H;
A=3*10^(-2)*3*10^(-2);
Phi=B*A;
N=550;
E5=-N* gradient(Phi)./gradient(t);


ETotal=E1+E3+E5;
max(ETotal)


V_rms=240;
V_peak=V_rms*sqrt(2);
f=50;
w=2*pi*f;
t=0:0.0001:0.1;
V=V_peak*sin(w*t);

figure;
hold on;
%plot(t, E1, 'b', 'DisplayName', 'Induced EMF 1');
%plot(t, E3, 'r', 'DisplayName', 'Induced EMF 2');
%plot(t, E5, 'g', 'DisplayName', 'Induced EMF 3');
plot(t, ETotal, 'DisplayName', 'Total induced EMF');
plot(t, V, 'DisplayName', 'Supply voltage');

titleStr = sprintf('Voltage');
title(titleStr, 'FontSize', 10);
xlabel('Time (s)');
ylabel('Voltage (V)');
legend('show');
hold off;
#+END_SRC

#+RESULTS:
: I_peak2 = 3
: ans = 339.12


339.254068
